#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Детектирование речевой активности в аудиовизуальном сигнале
"""

# ######################################################################################################################
# Импорт необходимых инструментов
# ######################################################################################################################

from dataclasses import dataclass # Класс данных

# Персональные
from openav.modules.lab.build import Run # Сборка библиотеки

# ######################################################################################################################
# Сообщения
# ######################################################################################################################
@dataclass
class Messages(Run):
    """Класс для сообщений"""

    # ------------------------------------------------------------------------------------------------------------------
    # Конструктор
    # ------------------------------------------------------------------------------------------------------------------

    def __post_init__(self):
        super().__post_init__() # Выполнение конструктора из суперкласса


# ######################################################################################################################
# Выполняем только в том случае, если файл запущен сам по себе
# ######################################################################################################################
@dataclass
class Run(Messages):
    """Класс для детектирования речевой активности в аудиовизуальном сигнале"""

    # ------------------------------------------------------------------------------------------------------------------
    # Конструктор
    # ------------------------------------------------------------------------------------------------------------------

    def __post_init__(self):
        super().__post_init__() # Выполнение конструктора из суперкласса

    # ------------------------------------------------------------------------------------------------------------------
    #  Внешние методы
    # ------------------------------------------------------------------------------------------------------------------

    # Запуск
    def run(self):
        """Запуск детектирования речевой активности в аудиовизуальном сигнале"""

        print('Привет мир')


def main():
    run = Run()

    run.run()


if __name__ == "__main__":
    main()
