#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Настройки
"""

# ######################################################################################################################
# Импорт необходимых инструментов
# ######################################################################################################################
# Подавление Warning
import warnings
for warn in [UserWarning, FutureWarning]: warnings.filterwarnings('ignore', category = warn)

from dataclasses import dataclass # Класс данных

from colorama import init  # Цветной текст терминала

# Персональные
from openav.modules.core.messages import Messages # Сообщения

# ######################################################################################################################
# Настройки
# ######################################################################################################################
@dataclass
class Settings(Messages):
    """Класс для настроек"""

    # ------------------------------------------------------------------------------------------------------------------
    # Конструктор
    # ------------------------------------------------------------------------------------------------------------------

    def __post_init__(self):
        super().__post_init__() # Выполнение конструктора из суперкласса

        init() # Инициализация терминала с возможностью цветного текста

        self.__color_green: str = '\033[92m' # Зеленый
        self.__color_red: str = '\033[91m'   # Красный
        self.__color_blue: str = '\033[94m'  # Синий
        self.__text_bold: str = '\033[1m'    # Жирный
        self.__text_end: str = '\033[0m'     # Выход

    # ------------------------------------------------------------------------------------------------------------------
    # Свойства
    # ------------------------------------------------------------------------------------------------------------------

    @property
    def color_green(self) -> str:
        """Получение зеленого цвета текста в терминале

        Returns:
            str: Цвет текста в терминале
        """

        return self.__color_green

    @property
    def color_red(self) -> str:
        """Получение красного цвета текста в терминале

        Returns:
            str: Цвет текста в терминале
        """

        return self.__color_red

    @property
    def color_blue(self) -> str:
        """Получение синего цвета текста в терминале

        Returns:
            str: Цвет текста в терминале
        """

        return self.__color_blue

    @property
    def text_bold(self) -> str:
        """Получение жирного начертания текста в терминале

        Returns:
            str: Жирное начертание текста в терминале
        """

        return self.__text_bold

    @property
    def text_end(self) -> str:
        """Получение сброса оформления текста в терминале

        Returns:
            str: Сброс оформления текста в терминале
        """

        return self.__text_end
